revolving_wing_cases/rev_job_array/r04_ar2_aoa70/backGround/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    AMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }
    AMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }

    wing
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    farField
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
